benchmark_results/uds_result.txt
Running 10s test @ http://127.0.0.1:8080/echo
  4 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     3.32ms  742.21us  18.62ms   76.06%
    Req/Sec     4.81k   210.65     5.31k    69.25%
  Latency Distribution
     50%    3.25ms
     75%    3.69ms
     90%    4.18ms
     99%    5.37ms
  191611 requests in 10.01s, 33.44MB read
Requests/sec:  19142.38
Transfer/sec:      3.34MB